GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		//  camera.c
 * Author:			//  baiyangmin
 * Date:			//  2013-07-08
 * Description:		//  拍照功能的实现，包括有:拍照，存储，以及相关接口函数，该文件实现了文件jt808_camera.c的拍照部分驱动功能
 * Version:			//  V0.01
 * Function List:	//  主要函数及其功能
 *     1. -------
 * History:			//  历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <dfs_posix.h>

#include "stm32f4xx.h"
#include "rs485.h"
#include "jt808.h"
#include "jt808_gps.h"
#include "camera.h"
#include "jt808_camera.h"
#include <finsh.h>
#include "sst25.h"

typedef enum
{
	CAM_NONE = 0,
	CAM_IDLE,
	CAM_START,
	CAM_GET_PHOTO,
	CAM_RX_PHOTO,
	CAM_OK,
	CAM_FALSE,
	CAM_END
}CAM_STATE;

typedef enum
{
	RX_IDLE = 0,
	RX_SYNC1,
	RX_SYNC2,
	RX_HEAD,
	RX_DATA,
	RX_FCS,
	RX_0D,
	RX_0A,
}CAM_RX_STATE;

typedef  __packed struct
{
	CAM_STATE				State;      ///处理过程状态，
	CAM_RX_STATE			Rx_State;   ///接收状态
	u8						Retry;      ///重复照相次数
	Style_Cam_Requset_Para	Para;       ///触发当前拍照相关信息
} Style_Cam_Para;

#define DF_CamAddress_Start 0x40000     ///图片数据存储开始位置
#define DF_CamAddress_End	0X60000     ///图片数据存储结束位置
#define DF_CamSaveSect		0x400       ///图片数据存储最小间隔

extern rt_device_t _console_device;
extern u16 Hex_To_Ascii( const u8* pSrc, u8* pDst, u16 nSrcLength );


const char				CAM_HEAD[] = { "PIC_01" };

static Style_Cam_Para	Current_Cam_Para;
static TypeDF_PICPara	DF_PicParameter;      ///FLASH存储的图片信息

/* 消息队列控制块*/
struct rt_messagequeue	mq_Cam;
/* 消息队列中用到的放置消息的内存池*/
static char				msgpool_cam[256];

extern MsgList			* list_jt808_tx;


/*********************************************************************************
  *函数名称:u8 HEX_to_BCD(u8 HEX)
  *功能描述:将1个字节大小的HEX码转换为BCD码；返回BCD码
  *输 入:none
  *输 出:none
  *返 回 值:none
  *作 者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 HEX_to_BCD( u8 HEX )
{
	u8 BCD_code = 0;
	BCD_code	= HEX % 10;
	BCD_code	|= ( ( HEX % 100 ) / 10 ) << 4;
	return BCD_code;
}

/*********************************************************************************
  *函数名称:u8 BCD_to_HEX(u8 BCD)
  *功能描述:将1个字节大小的BCD码转换为HEX码；返回HEX码
  *输 入:none
  *输 出:none
  *返 回 值:none
  *作 者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 BCD_to_HEX( u8 BCD )
{
	u8 HEX_code = 0;
	HEX_code	= BCD & 0x0F;
	HEX_code	+= ( BCD >> 4 ) * 10;
	return HEX_code;
}

/*********************************************************************************
  *函数名称:bool leap_year(u16 year)
  *功能描述:本函数计算年year是不是闰年,是闰年返回1,否则返回0;
   闰年为366天否则为365天,闰年的2月为29天.
  *输	入:year	年
  *输	出:none
  *返 回 值:,是闰年返回1,否则返回0;
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 leap_year( u16 year )
{
	u8 leap;
	if( ( year & 0x0003 ) == 0 )
	{
		if( year % 100 == 0 )
		{
			if( year % 400 == 0 )
			{
				leap = 1;
			} else
			{
				leap = 0;
			}
		}else
		{
			leap = 1;
		}
	}else
	{
		leap = 0;
	}
	return leap;
}

/*********************************************************************************
  *函数名称:u32 Timer_To_Day(T_TIMES *T)
  *功能描述:计算该时间的总天数，开始时间为2000年1月1日
  *输	入:none
  *输	出:none
  *返 回 值:时间对应的秒
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 Timer_To_Day( T_TIMES *T )
{
	u32 long_day;
	u16 i, year, month, day;

	year		= BCD_to_HEX( T->years );
	month		= BCD_to_HEX( T->months );
	day			= BCD_to_HEX( T->days );
	year		+= 2000;
	long_day	= 0;
	for( i = 2000; i < year; i++ )
	{
		long_day	+= 365;
		long_day	+= leap_year( i );
	}

	switch( month )
	{
		case 12:
			long_day += 30;
		case 11:
			long_day += 31;
		case 10:
			long_day += 30;
		case 9:
			long_day += 31;
		case 8:
			long_day += 31;
		case 7:
			long_day += 30;
		case 6:
			long_day += 31;
		case 5:
			long_day += 30;
		case 4:
			long_day += 31;
		case 3:
		{
			long_day	+= 28;
			long_day	+= leap_year( year );
		}
		case 2:
			long_day += 31;
		case 1:
			long_day += day - 1;
		default:
			nop;
	}
	return long_day;
}

/*********************************************************************************
  *函数名称:u8 Get_Month_Day(u8 month,u8 leapyear)
  *功能描述:获取该月的天数
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 Get_Month_Day( u8 month, u8 leapyear )
{
	u8 day;
	switch( month )
	{
		case 12:
			day = 31;
			break;
		case 11:
			day = 30;
			break;
		case 10:
			day = 31;
			break;
		case 9:
			day = 30;
			break;
		case 8:
			day = 31;
			break;
		case 7:
			day = 31;
			break;
		case 6:
			day = 30;
			break;
		case 5:
			day = 31;
			break;
		case 4:
			day = 30;
			break;
		case 3:
			day = 31;
			break;
		case 2:
		{
			day = 28;
			day += leapyear;
			break;
		}
		case 1:
			day = 31;
			break;
		default:
			day = 0;
	}
	return day;
}

/*********************************************************************************
  *函数名称:u32 Times_To_LongInt(T_TIMES *T)
  *功能描述:本函数将RTC_TIMES类型的时间转换为long int类型的数据，
   单位为秒，起始时间为2000年1月1日00:00:00
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 Times_To_LongInt( T_TIMES *T )
{
	u32 timer_int, hour;
	u16 minute, second;
	hour		= BCD_to_HEX( T->hours );
	minute		= BCD_to_HEX( T->minutes );
	second		= BCD_to_HEX( T->seconds );
	timer_int	= Timer_To_Day( T );
	hour		*= 3600;
	minute		*= 60;
	timer_int	= timer_int * 86400 + hour + minute + second; ///timer_int*24*3600=timer_int*86400
	return timer_int;
}

/*********************************************************************************
   *函数名称:void LongInt_To_Times(u32 timer_int, T_TIMES *T)
   *功能描述:将基准时间是2000年1月1日00:00:00的长整形数据转为T_TIMES类型
   *输	入:none
   *输	出:none
   *返 回 值:none
   *作	者:白养民
   *创建日期:2013-06-3
   *---------------------------------------------------------------------------------
   *修 改 人:
   *修改日期:
   *修改描述:
 **********************************************6***********************************/
void LongInt_To_Times( u32 timer_int, T_TIMES *T )
{
	u32 long_day1, long_day2;
	u16 i, day, leapyear = 0;
	long_day2	= 0;
	long_day1	= timer_int / 86400;
	for( i = 2000; i < 2100; i++ )
	{
		day			= 365 + leap_year( i );
		long_day2	+= day;
		//如果当前年的总天数小于计算天数则得到了年份
		if( long_day2 > long_day1 )
		{
			long_day2	-= day;
			leapyear	= leap_year( i );
			break;
		}
	}
	T->years = HEX_to_BCD( i - 2000 );
	for( i = 1; i <= 12; i++ )
	{
		day			= Get_Month_Day( i, leapyear );
		long_day2	+= day;
		//如果当前月的总天数小于计算天数则得到了月份
		if( long_day2 > long_day1 )
		{
			long_day2 -= day;
			break;
		}
	}
	T->months	= HEX_to_BCD( i );
	day			= long_day1 - long_day2 + 1;
	T->days		= HEX_to_BCD( day );

	long_day1	= timer_int % 86400;
	i			= long_day1 / 3600;
	T->hours	= HEX_to_BCD( i );

	i			= long_day1 % 3600 / 60;
	T->minutes	= HEX_to_BCD( i );

