GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
	if( DF_PicParameter.Number == 0 )
	{
		return 0xFFFFFFFF;
	}
	if( ( id < DF_PicParameter.FirstPic.Data_ID ) || ( id > DF_PicParameter.LastPic.Data_ID ) )
	{
		return 0xFFFFFFFF;
	}
	if( id != lastPackInfo.Data_ID )
	{
		lastPackInfo.Data_ID	= 0xFFFFFFFF;
		TempAddress				= DF_PicParameter.FirstPic.Address;
		for( i = 0; i < DF_PicParameter.Number; )
		{
			TempAddress = Cam_Flash_AddrCheck( TempAddress );
			sst25_read( TempAddress, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
			//rt_kprintf("\n NUM=%d,ADDR=%d,ID=%d, Head=",i,TempAddress,TempPackageHead.Data_ID);
			//printer_data_hex((u8 *)&TempPackageHead,sizeof(TypeDF_PackageHead)-28);
			if( strncmp( TempPackageHead.Head, CAM_HEAD, strlen( CAM_HEAD ) ) == 0 )
			{
				///查看该图片是否被删除
				if( TempPackageHead.State & BIT( 0 ) )
				{
					if( TempPackageHead.Data_ID == id )
					{
						lastPackInfo.Data_ID	= id;
						lastPackInfo.Address	= TempAddress;
						lastPackInfo.Len		= TempPackageHead.Len;
						memcpy( (void*)p_head, (void*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
						return lastPackInfo.Address;
					}
				}
				i++;
				//TempAddress+=(TempPackageHead.Len+DF_CamSaveSect-1)/DF_CamSaveSect*DF_CamSaveSect;
				tempu32data			= ( TempPackageHead.Len + DF_CamSaveSect - 1 ) / DF_CamSaveSect;
				TempAddress			+= tempu32data * DF_CamSaveSect;
				flash_search_area	+= tempu32data;
			}else
			{
				TempAddress += DF_CamSaveSect; ///修改存储异常，在此增加该代码，之前代码直接返回OXffff
				//return 0xFFFFFFFF;
				flash_search_area++;
			}
			if( flash_search_area > ( DF_CamAddress_End - DF_CamAddress_Start ) / DF_CamSaveSect )
			{
				return 0xFFFFFFFF;
			}
		}
	}else
	{
		memcpy( (void*)p_head, (void*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
		return lastPackInfo.Address;
	}
	return 0xFFFFFFFF;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_RdPic(void *pData,u16 *len, u32 id,u8 offset )
  *功能描述:从FLASH中读取图片数据
  *输	入:	pData:写入的数据指针，指向数据buf；
   len:返回的数据长度指针注意，该长度最大为512
   id:多媒体ID号
   offset:多媒体数据偏移量，从0开始，0表示读取多媒体图片包头信息，包头信息长度固定为64字节，采用
    结构体TypeDF_PackageHead格式存储
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_RdPic( void *pData, u16 *len, u32 id, u8 offset )
{
	u32					TempAddress;
	u32					temp_Len;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	*len = 0;
	//rt_kprintf("\n take_flash_sem");
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead );
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	if( TempPackageHead.Data_ID == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	if( offset > ( TempPackageHead.Len - 1 ) / 512 )
	{
		ret = RT_ENOMEM; goto FUNC_RET;
	}
	if( offset == ( TempPackageHead.Len - 1 ) / 512 )
	{
		temp_Len = TempPackageHead.Len - ( offset * 512 );
	}else
	{
		temp_Len = 512;
	}
	sst25_read( TempAddress + offset * 512, (u8*)pData, temp_Len );
	*len = temp_Len;

	ret = RT_EOK;

FUNC_RET:
	//rt_kprintf("\n releas_flash_sem");
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_DelPic(u32 id)
  *功能描述:从FLASH中删除图片，实际上并没有删除，而是将删除标记清0，这样下次就再也不查询该图片
  *输	入:	id:多媒体ID号
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_DelPic( u32 id )
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead );
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	TempPackageHead.State &= ~( BIT( 0 ) );
	sst25_write_through( TempAddress, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
	ret = RT_EOK;

FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_TransOkSet(u32 id)
  *功能描述:将该ID的图片标记为发送成功
  *输	入:	id:多媒体ID号
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_TransOkSet( u32 id )
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead );
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	TempPackageHead.State &= ~( BIT( 1 ) );
	sst25_write_through( TempAddress, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
	ret = RT_EOK;

FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:u16 Cam_Flash_SearchPic(T_TIMES *start_time,T_TIMES *end_time,TypeDF_PackageHead *para,u8 *pdest)
  *功能描述:从FLASH中查找指定时间段的图片索引
  *输	入:	start_time	开始时间，
   end_time		结束时间，
   para			查找图片的属性
   pdest			存储查找到得图片的位置，每个多媒体图片占用4个字节
  *输	出: u16 类型，表示查找到得图片数量
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 Cam_Flash_SearchPic( T_TIMES *start_time, T_TIMES *end_time, TypeDF_PackageHead *para, u8 *pdest )
{
	u16					i;
	u32					TempAddress;
	u32					temp_u32;
	TypeDF_PackageHead	TempPackageHead;
	u16					ret_num = 0;

