GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
	if( DF_PicParameter.Number == 0 )
	{
		return 0;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = DF_PicParameter.FirstPic.Address;
	for( i = 0; i < DF_PicParameter.Number; i++ )
	{
		TempAddress = Cam_Flash_AddrCheck( TempAddress );
		sst25_read( TempAddress, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
		if( strncmp( TempPackageHead.Head, CAM_HEAD, strlen( CAM_HEAD ) ) == 0 )
		{
			///查看该图片是否被删除
			if( TempPackageHead.State & BIT( 0 ) )
			{
				///比较多媒体类型，多媒体通道，多媒体触发源
				if( ( TempPackageHead.Media_Style == para->Media_Style ) && ( ( TempPackageHead.Channel_ID == para->Channel_ID ) || ( para->Channel_ID == 0 ) ) && ( ( TempPackageHead.TiggerStyle == para->TiggerStyle ) || ( para->TiggerStyle == 0xFF ) ) )
				{
					temp_u32 = Times_To_LongInt( &TempPackageHead.Time );
					///比较时间是否在范围
					if( ( temp_u32 > Times_To_LongInt( start_time ) ) && ( temp_u32 <= Times_To_LongInt( end_time ) ) )
					{
						///找到了数据
						data_to_buf( pdest, TempAddress, 4 );
						//memcpy(pdest,&TempAddress,4);
						pdest += 4;
						ret_num++;
					}
				}
			}
			TempAddress += ( TempPackageHead.Len + DF_CamSaveSect - 1 ) / DF_CamSaveSect * DF_CamSaveSect;
		}else
		{
			TempAddress += DF_CamSaveSect; ///修改存储异常，在此增加该代码，之前代码直接返回OXffff
		}
	}

	rt_sem_release( &sem_dataflash );
	return ret_num;
}

#if 0


/*********************************************************************************
  *函数名称:static void delay_us( const uint32_t usec )
  *功能描述:延时函数，延时单位为us
  *输 入:	usec	:延时时间，单位为us
  *输 出:none
  *返 回 值:none
  *作 者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static void delay_us( const uint32_t usec )
{
	__IO uint32_t	count	= 0;
	const uint32_t	utime	= ( 168 * usec / 7 );
	do
	{
		if( ++count > utime )
		{
			return;
		}
	}
	while( 1 );
}

/*********************************************************************************
  *函数名称:static rt_err_t Cam_Device_open( void )
  *功能描述:打开模块供电
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static rt_err_t Cam_Device_open( void )
{
	Power_485CH1_ON;
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:static rt_err_t Cam_Devic_close( void )
  *功能描述:关闭模块供电
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static rt_err_t Cam_Devic_close( void )
{
	Power_485CH1_OFF;
	return RT_EOK;
}

#endif


/*********************************************************************************
  *函数名称:void Cam_Device_init( void )
  *功能描述:初始化CAM模块相关接口
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_Device_init( void )
{
	///开电
	Power_485CH1_ON;

	///初始化消息队列
	rt_mq_init( &mq_Cam, "mq_cam", &msgpool_cam[0], sizeof( Style_Cam_Requset_Para ), sizeof( msgpool_cam ), RT_IPC_FLAG_FIFO );

	///初始化flash参数
	Cam_Flash_InitPara( 0 );

	///初始化照相状态参数
	memset( (u8*)&Current_Cam_Para, 0, sizeof( Current_Cam_Para ) );
	Current_Cam_Para.State = CAM_NONE;
}

/*********************************************************************************
  *函数名称:static void Cam_Start_Cmd(u16 Cam_ID)
  *功能描述:向camera模块发送开始拍照指令
  *输	入:Cam_ID	需要拍照的camera设备ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static void Cam_Start_Cmd( u16 Cam_ID )
{
	u8 Take_photo[10] = { 0x40, 0x40, 0x61, 0x81, 0x02, 0X00, 0X00, 0X02, 0X0D, 0X0A }; //----  报警拍照命令
	Take_photo[4]	= (u8)Cam_ID;
	Take_photo[5]	= (u8)( Cam_ID >> 8 );
	RS485_write( Take_photo, 10 );
	uart2_rxbuf_rd = uart2_rxbuf_wr;
	rt_kprintf( "\n发送拍照命令" );
}

/*********************************************************************************
  *函数名称:static void Cam_Read_Cmd(u16 Cam_ID)
  *功能描述:向camera模块发送读取照片数据指令
  *输	入:Cam_ID	需要拍照的camera设备ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static void Cam_Read_Cmd( u16 Cam_ID )
{
	uint8_t Fectch_photo[10] = { 0x40, 0x40, 0x62, 0x81, 0x02, 0X00, 0XFF, 0XFF, 0X0D, 0X0A }; //----- 报警取图命令
	Fectch_photo[4] = (u8)Cam_ID;
	Fectch_photo[5] = (u8)( Cam_ID >> 8 );
	RS485_write( Fectch_photo, 10 );
	uart2_rxbuf_rd = uart2_rxbuf_wr;
	rt_kprintf( "\n读取照片命令" );
}

/*********************************************************************************
  *函数名称:TypeDF_PICPara Cam_get_state(void)
  *功能描述:获取系统拍照相关参数
  *输	入:none
  *输	出:none
  *返 回 值:TypeDF_PICPara
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
TypeDF_PICPara Cam_get_state( void )
{
	return DF_PicParameter;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void cam_wr_flash( u32 addr, char *psrc )
{
	char pstr[128];
	memset( pstr, 0, sizeof( pstr ) );
	memcpy( pstr, psrc, strlen( psrc ) );
	sst25_write_back( addr, (u8*)pstr, strlen( pstr ) + 1 );
}

FINSH_FUNCTION_EXPORT( cam_wr_flash, cam_wr_flash );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void cam_wr_flash_ex( u32 addr, char *psrc )
{
	char pstr[128];
	memset( pstr, 0, sizeof( pstr ) );
	memcpy( pstr, psrc, strlen( psrc ) );
	sst25_erase_4k( addr );
	sst25_write_through( addr, (u8*)pstr, strlen( pstr ) + 1 );
}

